from typing import List, Dict, Any

from bs4 import BeautifulSoup
import requests
import urllib3
import locale
import re
import csv
# import pandas as pd
# import json
# import os
# from selenium import webdriver
# link = 'https://zakupki.gov.ru/epz/order/notice/ok20/view/supplier-results.html?regNumber=0172500000423000006'

# from selenium import webdriver
# from selenium.webdriver.common.by import By
# from selenium.webdriver.support.ui import WebDriverWait
# from selenium.webdriver.support import expected_conditions as EC




# driver = webdriver.Chrome()

# # Переходим на страницу
# driver.get("https://example.com")

# # Используем метод find_element_by_class_name для поиска элемента с классом "hidden"
# elem = driver.find_element(By.CLASS_NAME,"tableBlock__col tableBlock__row")

# # Выводим содержимое элемента
# print(elem.text)

# # Закрываем браузер
# driver.quit()

# def supplier_result():
#     block_title = []
#     title_data= []
#     value_data = []
#     list_info= []
#     zakazchic_data= []
#     table_titles = []
#     all_table_info = []
#     doc_titles = []
#     new_dict = {}
#     i = 0
#     n = 0
#     # row_info = soup.find_all(class_= 'row blockInfo')
#     # for info in row_info:
#     driver = webdriver.Firefox()
#     driver.get(link)
#     import time
#     time.sleep(5)
#     html = driver.page_source

#     soup = BeautifulSoup(html, 'lxml')



#     col_9 = soup.find_all(class_='tableBlock__body')
#     print(col_9)


#     driver.quit()

# # supplier_result()

def journal_of_events():

        th_mass = []
        data = []
        fn_date= {}
        i = 0
        test_url3 = f'https://zakupki.gov.ru/epz/order/notice/ok44/view/event-journal.html?regNumber=0373100112518000004'
            
        HEADERS_test = {
                'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0'
                              ' YaBrowser/23.3.0.2246 Yowser/2.5 Safari/537.36', 'accept': '*/*'}
        params ={

                'regNumber': '0373100112518000004' 
            }
        req = requests.get(test_url3, headers=HEADERS_test, params=None)
        src = req.text
        soup = BeautifulSoup(src, 'lxml')
        # driver.quit()
        wrapper = soup.find('div', class_='container')
        return soup.get_text()
        #не нашел журнал событий
        try:
            for tbn in wrapper:
                c_th = tbn.find_all('th')
                for th_items in c_th:
                    th_text = th_items.get_text().strip()
                    th_mass.append(th_text)

                c_td = tbn.find_all('td')
                for td_items in c_td:
                    td_text = td_items.get_text().strip()
                    try:
                        data.append({th_mass[i]: td_text})
                    except Exception:
                        i = 0
                        data.append({th_mass[i]: td_text})
                    i += 1
            status = 'Успешный парсинг Журнала'
            return data

        except Exception:
            status = 'Ошибка парснига  Журнала'

# print(journal_of_events())

def makeLinkNum(numer):
    num = numer
    try:
        search_url = f'https://zakupki.gov.ru/epz/order/extendedsearch/results.html?searchString={numer}&morphology=on&search-filter=Дате+размещения&pageNumber=1&sortDirection=false&recordsPerPage=_10&showLotsInfoHidden=false&sortBy=UPDATE_DATE&fz44=on&fz223=on&af=on&ca=on&pc=on&pa=on&currencyIdGeneral=-1'
        # test_url3 = f'https://zakupki.gov.ru/epz/order/notice/ok20/view/common-info.html?regNumber={numer}'
        HEADERS_test = {
            'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0'
                            ' YaBrowser/23.3.0.2246 Yowser/2.5 Safari/537.36', 'accept': '*/*'}
        req = requests.get(search_url, headers=HEADERS_test, params=None)
        src = req.text
        soup = BeautifulSoup(src, 'lxml')
        status = 'Успешное подключение'
        col = soup.find('div', class_ = 'registry-entry__header-mid__number')
        a_tag = col.find('a')
        match = re.search(r'noticeInfoId=(\d+)', a_tag['href'])
        number = match.group(1)
        return  number
    except:
        status = 'Ошибка подключения'


# print(agent('31704961137'))


################################
# data = ['223-ФЗ Прочие', '№ 31704961137', 'Закупка завершена', 'Объект закупки', 'проведение работ и услуг по строительству и поставки многофункционального судна снабжения 001', 'Заказчик', 'АКЦИОНЕРНОЕ ОБЩЕСТВО "ДАЛЬНЕВОСТОЧНЫЙ ЦЕНТР СУДОСТРОЕНИЯ И СУДОРЕМОНТА"', 'Начальная цена', '11 821 240 000,00 ₽', 'Размещено', '31.03.2017', 'Обновлено', '31.03.2017', 'Сведения о закупке', 'Реестровый номер извещения', '31704961137', 'Способ осуществления закупки', 'Внутригрупповая закупка', 'Наименование закупки', 'проведение работ и услуг по строительству и поставки многофункционального судна снабжения 001', 'Редакция', '1', 'Дата размещения извещения', '31.03.2017', 'Дата размещения текущей редакции извещения', '31.03.2017', 'Сведения о заказчике', 'Наименование организации', 'АКЦИОНЕРНОЕ ОБЩЕСТВО "ДАЛЬНЕВОСТОЧНЫЙ ЦЕНТР СУДОСТРОЕНИЯ И СУДОРЕМОНТА"', 'ИНН', '2536196045', 'КПП', '253601001', 'ОГРН', '1072536016211', 'Место нахождения', '690001, Г.. ВЛАДИВОСТОК, УЛ. СВЕТЛАНСКАЯ, Д.72', 'Почтовый адрес', '690001, Приморский край, г. Владивосток, ул. Светланская, д. 72', 'Контактная информация', 'Адрес электронной почты', 'dcss@dcss.ru', 'Контактный телефон', '+8 (423) 2651736', 'Порядок проведения процедуры', 'Рассмотрение заявок', 'Место рассмотрения заявок', 'Владивосток, Светланская, 72', 'Дата рассмотрения заявок', '31.03.2017 (МСК+7)', 'Подведение итогов', 'Место подведения итогов', 'Владивосток, Светланская, 72', 'Дата подведения итогов', '31.03.2017', 'Предоставление документации', 'Срок предоставления', 'с 31.03.2017 по', '31.03.2017', 'Место предоставления', 'не применимо', 'Порядок предоставления', 'не применимо', 'Официальный сайт ЕИС, на котором размещена документация', 'www.zakupki.gov.ru', 'Внесение платы за предоставление конкурсной документации', 'Требования не установлены', 'Сведения о лотах', 'Номер, наименование лота', 'Централизованная закупка', 'Сведения о цене договора', 'Классификация по ОКПД2', 'Классификация по ОКВЭД2', '1', 'Строительство и поставка многофункционального судна снабжения  усиленного ледового класса', 'Нет', 'Начальная (максимальная) цена договора:', '11 821 240 000,00 ₽', '30.11 Корабли, суда и плавучие конструкции', '30.11 Строительство кораблей, судов и плавучих конструкций', '№', 'Критерий', 'Описание', 'Максимальное значение', 'Вес', 'Место поставки товара, выполнения работы, оказания услуги', 'Место поставки товара, выполнения работы, оказания услуги (субъект РФ)', 'Приморский край', 'Место поставки товара, выполнения работы, оказания услуги (адрес)', 'г. Большой Камень', 'Документация по закупке', 'Извещение о закупке № 31704961137 (Версия №1)', 'Размещено', '31.03.2017 09:22', '(МСК+7)', 'Редакция', 'Действующая', 'Прикрепленные файлы', 'Закупочная документация', 'Протоколы работы комиссии', 'Иной протокол №31704961137-01', 'Размещено', '31.03.2017 09:47', '(МСК+7)', 'Редакция', 'Действующая', 'Прикрепленные файлы', 'Протокол', 'Извещение о проведении закупки', 'Наименование документа', 'Редакция', 'Статус', 'Размещено', 'Извещение о закупке № 31704961137', '1', 'Действующая', '31.03.2017 09:22 (МСК+7)', 'Изменения извещения', 'Сведения отсутствуют', 'Изменения извещения с отменой лотов', 'Сведения отсутствуют', 'Изменения извещения со сменой заказчика', 'Сведения отсутствуют', 'Разъяснения положений документации', 'Сведения отсутствуют', 'Отмена закупки', 'Сведения отсутствуют', 'Иной протокол', 'Наименование документа', 'Редакция', 'Статус', 'Размещено', 'Иной протокол №31704961137-01', '1', 'Действующая', '31.03.2017 09:47 (МСК+7)', 'Реестр договоров', 'Наименование документа', 'Редакция', 'Статус', 'Размещено', 'Договор №62536196045170000060003', '2', 'Действующая', '29.01.2019 09:20', '(МСК+7)', 'Договор №62536196045170000060001', '1', 'Недействующая', '02.06.2017 05:30', '(МСК+7)', ['Документация по закупке', 'Извещение о закупке № 31704961137 (Версия №1)', 'Размещено', '31.03.2017 09:22', '(МСК+7)', 'Редакция', 'Действующая', 'Прикрепленные файлы', 'Закупочная документация', 'Протоколы работы комиссии', 'Иной протокол №31704961137-01', 'Размещено', '31.03.2017 09:47', '(МСК+7)', 'Редакция', 'Действующая', 'Прикрепленные файлы', 'Протокол', 'Извещение о проведении закупки', 'Наименование документа', 'Редакция', 'Статус', 'Размещено', 'Извещение о закупке № 31704961137', '1', 'Действующая', '31.03.2017 09:22 (МСК+7)', 'Изменения извещения', 'Сведения отсутствуют', 'Изменения извещения с отменой лотов', 'Сведения отсутствуют', 'Изменения извещения со сменой заказчика', 'Сведения отсутствуют', 'Разъяснения положений документации', 'Сведения отсутствуют', 'Отмена закупки', 'Сведения отсутствуют'], ['Дата и время', 'Событие', '03.04.2017 05:05 (МСК+7)', 'Размещены первоначальные сведения о договоре «строительство и поставка многофункционального судна 001».', 'Извещение о закупке: № 31704961137 «проведение работ и услуг по строительству и поставки многофункционального судна снабжения 001 ».', 'Заказчик: АКЦИОНЕРНОЕ ОБЩЕСТВО "ДАЛЬНЕВОСТОЧНЫЙ ЦЕНТР СУДОСТРОЕНИЯ И СУДОРЕМОНТА".', 'Организация, разместившая сведения: АКЦИОНЕРНОЕ ОБЩЕСТВО "ДАЛЬНЕВОСТОЧНЫЙ ЦЕНТР СУДОСТРОЕНИЯ И СУДОРЕМОНТА".', '31.03.2017 10:16 (МСК+8)', 'Закупка переведена на этап «Размещение завершено» с этапа «Работа комиссии»', '31.03.2017 10:02 (МСК+8)', 'Закупка переведена на этап «Работа комиссии» с этапа «Размещение завершено»', '31.03.2017 09:47 (МСК+8)', 'Закупка переведена на этап «Размещение завершено» с этапа «Работа комиссии»', '31.03.2017 09:47 (МСК+8)', 'Размещен протокол № 31704961137-01 «Протокол утверждения закупочной документации и подписание договора».', 'Извещение о закупке: № 31704961137 «проведение работ и услуг по строительству и поставки многофункционального судна снабжения 001 ».', 'Способ закупки: Внутригрупповая закупка.', 'Заказчик: АКЦИОНЕРНОЕ ОБЩЕСТВО "ДАЛЬНЕВОСТОЧНЫЙ ЦЕНТР СУДОСТРОЕНИЯ И СУДОРЕМОНТА".', 'Организация, разместившая сведения: АКЦИОНЕРНОЕ ОБЩЕСТВО "ДАЛЬНЕВОСТОЧНЫЙ ЦЕНТР СУДОСТРОЕНИЯ И СУДОРЕМОНТА".', '31.03.2017 09:22 (МСК+8)', 'Закупка переведена на этап «Работа комиссии» с этапа «Подача заявок»', '31.03.2017 09:22 (МСК+8)', 'Закупка переведена на этап «Подача заявок» с этапа «Формирование извещения»', '31.03.2017 09:22 (МСК+8)', 'Размещено извещение о закупке № 31704961137 «проведение работ и услуг по строительству и поставки многофункционального судна снабжения 001 ».', 'Способ закупки: Внутригрупповая закупка.', 'Заказчик: АКЦИОНЕРНОЕ ОБЩЕСТВО "ДАЛЬНЕВОСТОЧНЫЙ ЦЕНТР СУДОСТРОЕНИЯ И СУДОРЕМОНТА".', 'Организация, разместившая сведения: АКЦИОНЕРНОЕ ОБЩЕСТВО "ДАЛЬНЕВОСТОЧНЫЙ ЦЕНТР СУДОСТРОЕНИЯ И СУДОРЕМОНТА".']]
# structured_data = {}

# # Проходим по данным с шагом 2 (чтобы использовать каждый второй элемент как ключ, а следующий - как значение)
# for i in range(0, len(data) - 1, 2):
#     key = data[i]
#     value = data[i + 1]
#     structured_data[key] = value

# # Последний элемент (если он есть) остается неструктурированным
# if len(data) % 2 != 0:
#     unstructured_data = data[-1]

# # Теперь structured_data - это словарь, в котором ключи и значения соответствуют вашим данным
# print(structured_data)

# # Переменная unstructured_data содержит последний элемент (неструктурированный)
# if len(data) % 2 != 0:
#     print("Неструктурированные данные:", unstructured_data)
################################
def makeMass(csv_filename):
    data_from_second_column = []
    # Открываем CSV файл для чтения
    with open(csv_filename, newline='', encoding='cp1251') as csvfile:
        reader = csv.reader(csvfile, delimiter=';')

        # Пропускаем заголовок, если есть
        next(reader, None)

        # Читаем вторую строку и выбираем вторую часть (индекс 1)
        for row in reader:
                # Проверяем, что строка содержит как минимум два элемента (для второго столбца)
                if len(row) >= 2:
                    # Добавляем элемент второго столбца в массив
                    data_from_second_column.append(row[1].replace("№", ""))
    print(data_from_second_column)